# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [3]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
The dataset includes string and float data.
"""

#### Select the rows where state is New York.

In [5]:
state_ny = temp[temp['State'] == 'New York']
state_ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [6]:
# state_ny['Temperature'].mean()
np.mean(state_ny['Temperature'])

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [7]:
# temp[temp['Temperature'] > 15]    # returns all columns with the filter
temp[['City','State']][(temp['Temperature'] > 15)]    # returns only the selected columns with the filter

       City        State
0       NYC     New York
3  Hartford  Connecticut
5    Treton   New Jersey
6    Newark   New Jersey

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [8]:
temp['City'][(temp['Temperature'] > 15)]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [9]:
temp['City'][(temp['Temperature'] > 15) & (temp['Temperature'] < 20)]
# temp[(temp['Temperature'] > 15) & (temp['Temperature'] < 20)]

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [10]:
# temp.describe()
print('mean',temp['Temperature'].mean())
print('std',temp['Temperature'].std())

mean 15.15873015873016
std 6.695264939070775

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [95]:
employees = pd.read_csv('Employee.csv')
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [96]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
There are only two columns (Years and Salary) that have numerical values, the rest of the dataset has categorical data.
"""

#### What's the average salary in this company?

In [97]:
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [98]:
employees['Salary'].max()

70

#### What's the lowest salary?

In [99]:
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [100]:
employees[['Name','Salary']].sort_values('Salary',ascending=True)

     Name  Salary
1   Maria      30
2   David      30
0    Jose      35
3   Sonia      35
4  Samuel      55
5     Eva      55
7   Pedro      60
6  Carlos      70
8     Ana      70

#### Find all the information about an employee called David.

In [101]:
employees[(employees['Name']) == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [102]:
employees['Salary'][employees['Name'] == 'David']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [103]:
employees[employees['Title']=='associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [104]:
# Method 1
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [105]:
# Method 2
employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [106]:
employees[(employees['Title']=='associate') & (employees['Salary']>55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [107]:
employees.groupby(['Years']).mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [108]:
employees[['Title','Salary']].groupby(['Title']).mean()

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [109]:
employees['Salary'].quantile([.25,.5,.75])

0.25    35.0
0.50    55.0
0.75    60.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [110]:
employees[['Gender','Salary']].groupby(['Gender']).mean()

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [111]:
employees[['Department','Years','Salary']].groupby(['Department']).describe()

           Years                                                Salary         \
           count      mean       std  min   25%  50%   75%  max  count   mean
Department
HR           3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0    3.0  45.00
IT           4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0    4.0  48.75
Sales        2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0  55.00


                  std   min    25%   50%   75%   max
Department
HR          21.794495  30.0  32.50  35.0  52.5  70.0
IT          19.311050  30.0  33.75  47.5  62.5  70.0
Sales        0.000000  55.0  55.00  55.0  55.0  55.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [120]:
x = lambda a: a.max() - a.min()

employees[['Department','Salary']].groupby(['Department']).apply(x)

            Salary
Department
HR              40
IT              40
Sales            0

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [2]:
orders = pd.read_csv('Orders.zip')
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [3]:
print(orders.dtypes)
orders.describe()

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,278465.221859,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,152771.368303,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,148333.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,284907.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,410079.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,541908.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In [ ]:
"""
Most of the columns include numerical data. However, there are also some numerical columns that should be transformed
into categorical columns, as this is better for further analysis. (Unnamed:0,InvoiceNo,CustomerID)
All numerical columns have the same count of rows.
The standard deviation of quantity and amount_spent vary extremly.
"""

####  What is the average purchase price?

In [4]:
orders['amount_spent'].mean()

22.39474850474768

#### What are the highest and lowest purchase prices?

In [5]:
print('max: ',orders['amount_spent'].max())
print('min: ',orders['amount_spent'].min())

max:  168469.6
min:  0.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [6]:
orders[['CustomerID','Country']][orders['Country']=='Spain'].drop_duplicates()

        CustomerID Country
4250         12557   Spain
13974        17097   Spain
17368        12540   Spain
23288        12551   Spain
29804        12484   Spain
31390        12539   Spain
37428        12510   Spain
41390        12421   Spain
49687        12502   Spain
53374        12462   Spain
55336        12507   Spain
70307        12541   Spain
70657        12547   Spain
79781        12597   Spain
88639        12545   Spain
103106       12596   Spain
113099       12354   Spain
116553       12417   Spain
147386       12455   Spain
162904       12450   Spain
169315       12548   Spain
180343       12556   Spain
250565       12550   Spain
254077       12546   Spain
289129       12454   Spain
306993       12448   Spain
320987       12544   Spain
336389       12538   Spain
352636       12445   Spain
391792       12442   Spain

#### How many customers do we have in Spain?

In [7]:
orders[['CustomerID','Country']][orders['Country']=='Spain'].drop_duplicates().value_counts('Country')

Country
Spain    30
dtype: int64

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [8]:
customer_quantity = orders[['CustomerID','Quantity']].groupby(['CustomerID']).sum().reset_index()
customer_quantity[customer_quantity['Quantity']>50].sort_values('Quantity')

      CustomerID  Quantity
1864       14890        51
2502       15748        51
193        12587        51
2207       15350        51
2642       15945        52
...          ...       ...
0          12346     74215
55         12415     77670
1880       14911     80515
3009       16446     80997
1690       14646    197491

[4091 rows x 2 columns]

#### Select orders from Spain that include more than 50 items.

In [9]:
orders[['InvoiceNo','Quantity','Country']][(orders['Country']=='Spain') & (orders['Quantity']>50)]

        InvoiceNo  Quantity Country
4250       536944        70   Spain
4251       536944       100   Spain
4252       536944        60   Spain
4253       536944        70   Spain
4254       536944       100   Spain
32454      540785       144   Spain
32455      540785       360   Spain
32456      540785       360   Spain
32457      540785       144   Spain
91155      547972       150   Spain
91156      547972       150   Spain
91159      547972       150   Spain
174442     558871       100   Spain
174443     558871       100   Spain
174444     558871       100   Spain
174445     558871       100   Spain
174446     558871        72   Spain
174447     558871       360   Spain
174448     558871       360   Spain
174449     558871        72   Spain
197167     561669       128   Spain
197168     561669       144   Spain
197169     561669       128   Spain
197170     561669       128   Spain
197171     561669       128   Spain
224881     564734        60   Spain
254097     567968        96   Spain
289129     571255        72   Spain
289134     571255        72   Spain
289142     571255       200   Spain
289143     571255       288   Spain
295956     571851        96   Spain
312655     573362        72   Spain
312656     573362        72   Spain
312657     573362        72   Spain
366326     578321       200   Spain
366327     578321        72   Spain
366328     578321       360   Spain
366329     578321       288   Spain

#### Select all free orders.

In [10]:
orders[['InvoiceNo','amount_spent']][orders['amount_spent']==0]

        InvoiceNo  amount_spent
6914       537197           0.0
22539      539263           0.0
25379      539722           0.0
29080      540372           0.0
29082      540372           0.0
34494      541109           0.0
53788      543599           0.0
85671      547417           0.0
92875      548318           0.0
97430      548871           0.0
107192     550188           0.0
128641     553000           0.0
137127     554037           0.0
194648     561284           0.0
197173     561669           0.0
199711     561916           0.0
208950     562973           0.0
223931     564651           0.0
223932     564651           0.0
223933     564651           0.0
223934     564651           0.0
256263     568158           0.0
259399     568384           0.0
273926     569716           0.0
286507     571035           0.0
307092     572893           0.0
319882     574138           0.0
320049     574175           0.0
320407     574252           0.0
322279     574469           0.0
328385     574879           0.0
329006     574920           0.0
329007     574920           0.0
334242     575579           0.0
334243     575579           0.0
352746     577129           0.0
353097     577168           0.0
354170     577314           0.0
358629     577696           0.0
370473     578841           0.0

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [11]:
orders[['InvoiceNo','Description']][orders['Description'].str.contains('lunch bag')]

        InvoiceNo                  Description
93         536378      lunch bag red retrospot
172        536385  lunch bag dolly girl design
354        536401  lunch bag dolly girl design
359        536401      lunch bag red retrospot
360        536401   lunch bag spaceboy design
...           ...                          ...
397465     581486    lunch bag alphabet design
397713     581538      lunch bag  black skull.
397714     581538      lunch bag red retrospot
397877     581581  lunch bag red vintage doily
397880     581583      lunch bag red retrospot

[11556 rows x 2 columns]

#### Select all `lunch bag` orders made in 2011.

In [12]:
orders[['InvoiceNo','Description','year']][(orders['Description'].str.contains('lunch bag')) & (orders['year']==2011)]

        InvoiceNo                  Description  year
26340      540015      lunch bag red retrospot  2011
26341      540015           lunch bag woodland  2011
26512      540023   lunch bag spaceboy design   2011
26513      540023           lunch bag woodland  2011
26860      540098      lunch bag pink polkadot  2011
...           ...                          ...   ...
397465     581486    lunch bag alphabet design  2011
397713     581538      lunch bag  black skull.  2011
397714     581538      lunch bag red retrospot  2011
397877     581581  lunch bag red vintage doily  2011
397880     581583      lunch bag red retrospot  2011

[11234 rows x 3 columns]

#### Show the frequency distribution of the amount spent in Spain.

In [90]:
orders[['Country','amount_spent']][orders['Country']=='Spain'].value_counts(['amount_spent'])

amount_spent
15.00           186
17.70           122
19.80            99
17.40            86
10.20            76
               ...
17.90             1
16.65             1
14.94             1
14.22             1
17.25             1
Length: 316, dtype: int64

#### Select all orders made in the month of August.

In [16]:
orders[['InvoiceNo','month']][orders['month']==8].drop_duplicates()

        InvoiceNo  month
199475     561904      8
199477     561905      8
199487     561906      8
199519     561907      8
199536     561908      8
...           ...    ...
226310     564976      8
226334     564995      8
226379     565014      8
226394     565056      8
226417     565067      8

[1281 rows x 2 columns]

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [33]:
# The result of this function doesn't look correct
# orders[['InvoiceNo','month','Country']][orders['month']==8].groupby(by=['Country']).sum().sort_values(['month']).drop(columns=['InvoiceNo'])

# The result of this function make more sense
orders[['InvoiceNo','month','Country']][orders['month']==8].groupby(by=['Country']).size()

Country
Australia            107
Austria               88
Belgium              194
Canada                 5
Channel Islands      140
Denmark               16
EIRE                 593
Finland               61
France               569
Germany              795
Iceland               22
Israel               171
Italy                 95
Malta                 55
Netherlands          280
Norway                77
Poland                17
Portugal              41
Spain                252
Sweden                40
Switzerland          267
United Kingdom     23105
Unspecified           23
dtype: int64

#### What's the  average amount of money spent by country?

In [67]:
orders[['Country','amount_spent']].groupby(['Country']).mean().reset_index()

                 Country  amount_spent
0              Australia    116.895620
1                Austria     25.624824
2                Bahrain     32.258824
3                Belgium     20.283772
4                 Brazil     35.737500
5                 Canada     24.280662
6        Channel Islands     27.340160
7                 Cyprus     22.134169
8         Czech Republic     33.069600
9                Denmark     49.882474
10                  EIRE     36.687745
11    European Community     21.670833
12               Finland     32.913985
13                France     25.056827
14               Germany     25.311562
15                Greece     32.831172
16               Iceland     23.681319
17                Israel     29.119718
18                 Italy     23.064960
19                 Japan    116.561900
20               Lebanon     37.641778
21             Lithuania     47.458857
22                 Malta     24.335625
23           Netherlands    120.798282
24                Norway     33.736418
25                Poland     22.226212
26              Portugal     22.872702
27                   RSA     17.281207
28          Saudi Arabia     16.213333
29             Singapore     95.852658
30                 Spain     24.779521
31                Sweden     85.096075
32           Switzerland     30.642752
33                   USA     20.002179
34  United Arab Emirates     27.974706
35        United Kingdom     20.625073
36           Unspecified     10.930615

#### What's the most expensive item?

In [42]:
# orders[['Description','UnitPrice']].max()     #gives the 'max' for both columns
# orders[['Description','UnitPrice']].max('UnitPrice',axis=1)       #shows an error
# orders[['Description','UnitPrice']].drop_duplicates().sort_values('UnitPrice',ascending=False)    #gives a list, but not an individual value

orders[['Description','UnitPrice']][orders['UnitPrice']==(orders['UnitPrice'].max())]

                               Description  UnitPrice
118352                             postage    8142.75
308822                              manual    4161.06
295254                              manual    3949.32
269591                              manual    3155.95
208732                              manual    2500.00
...                                    ...        ...
25379             regency cakestand 3 tier       0.00
137127           set of 6 soldier skittles       0.00
97430          heart garland rustic padded       0.00
92875   mini cake stand  hanging strawbery       0.00
53788         fairy cakes notebook a6 size       0.00

[8909 rows x 2 columns]

#### What is the average amount spent per year?

In [83]:
orders[['year','amount_spent']].groupby(['year']).mean().reset_index()

   year  amount_spent
0  2010     21.892733
1  2011     22.430074